In [ ]:
#!pip install gspread

In [2]:
#import library
import pandas as pd
import gspread

In [9]:
#setup service account
gc = gspread.service_account(filename='D:\\Study Mart\\test1-429316-f89a75c4b34b.json')

In [10]:
gc

In [11]:
#link google file
sheet = gc.open_by_url('https://docs.google.com/spreadsheets/d/1G0KbNBmsV6JU8sN6Ae9s26rk92peRs8uLVZJJGGIM78/edit?usp=sharing')

In [12]:
sheet

In [15]:
#call google worksheet
ws1 = sheet.worksheet('emp1')

In [42]:
ws1

In [43]:
#convert worksheet to DataFrame
df = pd.DataFrame(ws1.get_all_records())

In [44]:
df

    name1  age1
0   Sagar    26
1  Shawon    24
2   Shovo    21
3   Rahul    21

In [46]:
#call second worksheet
ws2 = sheet.worksheet('emp2')

In [47]:
ws2

In [50]:
df2 = pd.DataFrame(ws2.get_all_records())

In [52]:
df2

   name2  age2
0  David    30
1  Harry    25
2    Ron    22
3   Rose    23